Revit 2027 API
Application.GetSystemsAnalysisWorkflows Method
 Returns name and path information identifying systems analysis workflow files.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<string, string> GetSystemsAnalysisWorkflows()
Public Function GetSystemsAnalysisWorkflows As IDictionary(Of String, String)
public:
IDictionary<String^, String^>^ GetSystemsAnalysisWorkflows()
member GetSystemsAnalysisWorkflows : unit -> IDictionary<string, string>
Return Value
IDictionary<String, String>
 The map of systems analysis workflows.
Remarks
 The map that is returned contains a key that is the name of the systems analysis workflow, and the value is the path to the workflow file.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace